---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.BendDiameterTooSmall
source: html/fa39eb89-ce60-d91b-7ccc-cb44bfbb94e5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.BendDiameterTooSmall Property

Rebar Bend Diameter is too small.

## Syntax (C#)
```csharp
public static FailureDefinitionId BendDiameterTooSmall { get; }
```